IDEA StatiCa Open Model
LineLoad.GeometryPointsPath Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 list of line load points
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Polygon2D GeometryPointsPath { get; set; }
Public Property GeometryPointsPath As Polygon2D
	Get
	Set
public:
property Polygon2D^ GeometryPointsPath {
	Polygon2D^ get ();
	void set (Polygon2D^ value);
}
Property Value
Type: Polygon2D
See Also
Reference
LineLoad Class
IdeaRS.OpenModel.Detail.Loading Namespace